Docs/Reference/Content/images/dependencies/net10.0/d2/alloverit-generichost.d2
direction: left

aoi: AllOverIt
aoi.alloverit-generichost: AllOverIt.GenericHost
microsoft-extensions-hosting_10-0-9: Microsoft.Extensions.Hosting\nv10.0.9
microsoft-extensions-configuration_10-0-9: Microsoft.Extensions.Configuration\nv10.0.9
microsoft-extensions-configuration-abstractions_10-0-9: Microsoft.Extensions.Configuration.Abstractions\nv10.0.9
microsoft-extensions-configuration-binder_10-0-9: Microsoft.Extensions.Configuration.Binder\nv10.0.9
microsoft-extensions-configuration-commandline_10-0-9: Microsoft.Extensions.Configuration.CommandLine\nv10.0.9
microsoft-extensions-configuration-environmentvariables_10-0-9: Microsoft.Extensions.Configuration.EnvironmentVariables\nv10.0.9
microsoft-extensions-configuration-fileextensions_10-0-9: Microsoft.Extensions.Configuration.FileExtensions\nv10.0.9
microsoft-extensions-configuration-json_10-0-9: Microsoft.Extensions.Configuration.Json\nv10.0.9
microsoft-extensions-configuration-usersecrets_10-0-9: Microsoft.Extensions.Configuration.UserSecrets\nv10.0.9
microsoft-extensions-dependencyinjection_10-0-9: Microsoft.Extensions.DependencyInjection\nv10.0.9
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
microsoft-extensions-diagnostics_10-0-9: Microsoft.Extensions.Diagnostics\nv10.0.9
microsoft-extensions-fileproviders-abstractions_10-0-9: Microsoft.Extensions.FileProviders.Abstractions\nv10.0.9
microsoft-extensions-fileproviders-physical_10-0-9: Microsoft.Extensions.FileProviders.Physical\nv10.0.9
microsoft-extensions-hosting-abstractions_10-0-9: Microsoft.Extensions.Hosting.Abstractions\nv10.0.9
microsoft-extensions-logging_10-0-9: Microsoft.Extensions.Logging\nv10.0.9
microsoft-extensions-logging-abstractions_10-0-9: Microsoft.Extensions.Logging.Abstractions\nv10.0.9
microsoft-extensions-logging-configuration_10-0-9: Microsoft.Extensions.Logging.Configuration\nv10.0.9
microsoft-extensions-logging-console_10-0-9: Microsoft.Extensions.Logging.Console\nv10.0.9
microsoft-extensions-logging-debug_10-0-9: Microsoft.Extensions.Logging.Debug\nv10.0.9
microsoft-extensions-logging-eventlog_10-0-9: Microsoft.Extensions.Logging.EventLog\nv10.0.9
microsoft-extensions-logging-eventsource_10-0-9: Microsoft.Extensions.Logging.EventSource\nv10.0.9
microsoft-extensions-options_10-0-9: Microsoft.Extensions.Options\nv10.0.9
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
microsoft-extensions-hosting_10-0-9 <- aoi.alloverit-generichost
microsoft-extensions-configuration_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-abstractions_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-binder_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-commandline_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-environmentvariables_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-fileextensions_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-json_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-configuration-usersecrets_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-dependencyinjection_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-diagnostics_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-fileproviders-abstractions_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-fileproviders-physical_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-hosting-abstractions_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging-abstractions_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging-configuration_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging-console_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging-debug_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging-eventlog_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-logging-eventsource_10-0-9 <- microsoft-extensions-hosting_10-0-9
microsoft-extensions-options_10-0-9 <- microsoft-extensions-hosting_10-0-9
aoi.alloverit <- aoi.alloverit-generichost
aoi.alloverit-assertion <- aoi.alloverit
microsoft-extensions-hosting_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-hosting_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-binder_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-binder_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-commandline_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-commandline_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-environmentvariables_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-environmentvariables_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-fileextensions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-fileextensions_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-json_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-json_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-usersecrets_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-usersecrets_10-0-9.style.opacity: 0.8
microsoft-extensions-dependencyinjection_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-dependencyinjection_10-0-9.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-diagnostics_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-diagnostics_10-0-9.style.opacity: 0.8
microsoft-extensions-fileproviders-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-fileproviders-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-fileproviders-physical_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-fileproviders-physical_10-0-9.style.opacity: 0.8
microsoft-extensions-hosting-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-hosting-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-logging_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-configuration_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-configuration_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-console_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-console_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-debug_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-debug_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-eventlog_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-eventlog_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-eventsource_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-eventsource_10-0-9.style.opacity: 0.8
microsoft-extensions-options_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-options_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
