Docs/Reference/Content/images/dependencies/net8.0/mmd/alloverit-generichost.mmd
flowchart LR
  alloverit-generichost["AllOverIt.GenericHost"]
  microsoft-extensions-hosting_10-0-9["Microsoft.Extensions.Hosting<br>v10.0.9"]
  microsoft-extensions-configuration_10-0-9["Microsoft.Extensions.Configuration<br>v10.0.9"]
  microsoft-extensions-configuration-abstractions_10-0-9["Microsoft.Extensions.Configuration.Abstractions<br>v10.0.9"]
  microsoft-extensions-configuration-binder_10-0-9["Microsoft.Extensions.Configuration.Binder<br>v10.0.9"]
  microsoft-extensions-configuration-commandline_10-0-9["Microsoft.Extensions.Configuration.CommandLine<br>v10.0.9"]
  microsoft-extensions-configuration-environmentvariables_10-0-9["Microsoft.Extensions.Configuration.EnvironmentVariables<br>v10.0.9"]
  microsoft-extensions-configuration-fileextensions_10-0-9["Microsoft.Extensions.Configuration.FileExtensions<br>v10.0.9"]
  microsoft-extensions-configuration-json_10-0-9["Microsoft.Extensions.Configuration.Json<br>v10.0.9"]
  microsoft-extensions-configuration-usersecrets_10-0-9["Microsoft.Extensions.Configuration.UserSecrets<br>v10.0.9"]
  microsoft-extensions-dependencyinjection_10-0-9["Microsoft.Extensions.DependencyInjection<br>v10.0.9"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-9["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.9"]
  microsoft-extensions-diagnostics_10-0-9["Microsoft.Extensions.Diagnostics<br>v10.0.9"]
  microsoft-extensions-fileproviders-abstractions_10-0-9["Microsoft.Extensions.FileProviders.Abstractions<br>v10.0.9"]
  microsoft-extensions-fileproviders-physical_10-0-9["Microsoft.Extensions.FileProviders.Physical<br>v10.0.9"]
  microsoft-extensions-hosting-abstractions_10-0-9["Microsoft.Extensions.Hosting.Abstractions<br>v10.0.9"]
  microsoft-extensions-logging_10-0-9["Microsoft.Extensions.Logging<br>v10.0.9"]
  microsoft-extensions-logging-abstractions_10-0-9["Microsoft.Extensions.Logging.Abstractions<br>v10.0.9"]
  microsoft-extensions-logging-configuration_10-0-9["Microsoft.Extensions.Logging.Configuration<br>v10.0.9"]
  microsoft-extensions-logging-console_10-0-9["Microsoft.Extensions.Logging.Console<br>v10.0.9"]
  microsoft-extensions-logging-debug_10-0-9["Microsoft.Extensions.Logging.Debug<br>v10.0.9"]
  microsoft-extensions-logging-eventlog_10-0-9["Microsoft.Extensions.Logging.EventLog<br>v10.0.9"]
  microsoft-extensions-logging-eventsource_10-0-9["Microsoft.Extensions.Logging.EventSource<br>v10.0.9"]
  microsoft-extensions-options_10-0-9["Microsoft.Extensions.Options<br>v10.0.9"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-generichost --> microsoft-extensions-hosting_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-abstractions_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-binder_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-commandline_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-environmentvariables_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-fileextensions_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-json_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-configuration-usersecrets_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-dependencyinjection_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-diagnostics_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-fileproviders-abstractions_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-fileproviders-physical_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-hosting-abstractions_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging-abstractions_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging-configuration_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging-console_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging-debug_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging-eventlog_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-logging-eventsource_10-0-9
  microsoft-extensions-hosting_10-0-9 --> microsoft-extensions-options_10-0-9
  alloverit-generichost --> alloverit
  alloverit --> alloverit-assertion
  style microsoft-extensions-hosting_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-binder_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-commandline_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-environmentvariables_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-fileextensions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-json_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-usersecrets_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-diagnostics_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-fileproviders-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-fileproviders-physical_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-hosting-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-configuration_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-console_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-debug_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-eventlog_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-eventsource_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-options_10-0-9 fill:#FFEC96,opacity:0.8
